library-api/lib/book_generator.rb

  def self.generateRandomBook(count)
    (1..count).each do |i|
      title = Faker::Book.title
      description = Faker::Food.description
      quantity = rand(1..10)
      genre = Faker::Book.genre
      isbn = Faker::Code.isbn
      author = Faker::Book.author
      publisher = Faker::Book.publisher

      book = Book.create!( title: title, author: author, publisher: publisher, quantity: quantity, description: description, genre: genre )
---
INSERT INTO "books" ("title", "description", "quantity", "created_at", "updated_at", "author", "publisher", "genre") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def self.generateBookInventory(book_id, count)
    (1..count).each do |i|
      BookInventory.create!( book_id: book_id, status: 0, is_checkout: false )
---
INSERT INTO "book_inventories" ("book_id", "status", "is_checkout", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_id", "3a3a45bd-c683-458a-9764-4c1d65234f57"], ["status", 0], ["is_checkout", false], ["created_at", "2020-06-16 06:33:28.777935"], ["updated_at", "2020-06-16 06:33:28.777935"]]