library-api/lib/user_generator.rb

  def self.generateAdminUser
    User.create!( username: 'admin', firstname: 'John', lastname: 'Oliver', is_admin: true )
---
INSERT INTO "users" ("username", "firstname", "lastname", "is_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "admin"], ["firstname", "John"], ["lastname", "Oliver"], ["is_admin", true], ["created_at", "2020-06-15 08:13:46.842436"], ["updated_at", "2020-06-15 08:13:46.842436"]]

  def self.generateRandomUserCount(count)
    (1..count).each do |i|
      username = RandomUsername.username
      firstname = Faker::Name.first_name
      lastname = Faker::Name.last_name

      User.create!( username: username, firstname: firstname, lastname: lastname, is_admin: false )
---
INSERT INTO "users" ("username", "firstname", "lastname", "is_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "cosmicwillow"], ["firstname", "Issac"], ["lastname", "Ondricka"], ["is_admin", false], ["created_at", "2020-06-15 08:16:43.014067"], ["updated_at", "2020-06-15 08:16:43.014067"]]