library-api/app/controllers/api/v1/book_inventories_controller.rb

SELECT "book_inventories".* FROM "book_inventories"
---
  def index
    books = BookInventory.all