library-api/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "e6cf579d-c45e-405b-9732-167f85f2803c"], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    render json: User.find_by_id(id), status: :ok